#include "Service.h"
    void Info <char>::_Info_messages()
    {
        cout << "ѕредлагаетс€ консольный чат-мессенджер со следующим  функционалом:" << endl << " - регистраци€ пользователей - логин, пароль, им€"
            << endl << " - вход в чат по логину/паролю" << endl << " - отправка индивидуальных сообщений конкретному пользователю в личную беседу:"
            << endl << "   просмотр индивидуальных cообщений (может просмотреть только авторизованный в данный момент пользователь)"
            << endl << " - обмен сообщени€ми между всеми пользовател€ми чата одновременно:"
            << endl << "   посредством направлени€  сообщений в общий чат" << endl
            << "ѕримечание:  поскольку ввод информации разными пользовател€ми осуществл€етс€ с одной клавиатуры" << endl
            << "         то передача управлени€ от одного пользовател€ другому происходит через авторизацию логин/пароль" << endl;
        return;
    }
    void Info <char>::_Info_m_1()
    {
        system("cls");//очищаем экран, выбор вида сообщени€ - дл€ общего или  личного чата.
        cout << " -  ≈сли это сообщение предназначено дл€ всех пользователей-введите /1/." << endl
            << " -  ѕри вводе /2/ - отправл€ете сообщение в личный чат одному адресату : ";
        return;
    }
  string Info <char>::_Info_m_2(string un)
    {
        cout << " -  Ќаписать ещЄ одно сообщение? -- введите- /1/" << endl
            << " -  ќтобразить дл€ /" << un << "/ содержание личного чата -- введите- /2/" << endl
            << " -  „тобы освободить клавиатуру дл€ другого пользовател€ - любой другой символ. " << endl;
        return un;
    }